; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	Star3 - direction
	GroundStation5 - direction
	Star7 - direction
	Star1 - direction
	Star2 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(pointing satellite2 Planet15)
	(have_image Star8 thermograph0)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 image1)
	(have_image Star14 image1)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation6 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation6)
   goals met: 0 of 10
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 10
3. (calibrate satellite2 instrument6 groundstation6)
   added: (calibrated instrument6)
   goals met: 0 of 10
4. (turn_to satellite2 phenomenon16 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon16)
   goals met: 0 of 10
5. (take_image satellite2 phenomenon16 instrument6 image1)
   added: (have_image phenomenon16 image1)
   goals met: 1 of 10
6. (turn_to satellite2 phenomenon12 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon12)
   goals met: 1 of 10
7. (take_image satellite2 phenomenon12 instrument6 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 10
9. (take_image satellite2 phenomenon11 instrument6 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 10
10. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 10
11. (take_image satellite2 phenomenon10 instrument6 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 4 of 10
12. (turn_to satellite2 planet9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet9)
   goals met: 4 of 10
13. (take_image satellite2 planet9 instrument6 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 5 of 10
14. (turn_to satellite2 star13 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star13)
   goals met: 5 of 10
15. (take_image satellite2 star13 instrument6 image1)
   added: (have_image star13 image1)
   goals met: 6 of 10
16. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 6 of 10
17. (take_image satellite2 star14 instrument6 image1)
   added: (have_image star14 image1)
   goals met: 7 of 10
18. (turn_to satellite2 star8 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star8)
   goals met: 7 of 10
19. (take_image satellite2 star8 instrument6 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 8 of 10
20. (turn_to satellite2 planet15 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet15)
   goals met: 9 of 10
21. (take_image satellite2 planet15 instrument6 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 10 of 10
